/*
        6. Задачи шестого (6) семинара:
git checkout Lesson6task41 - Задача 41. Пользователь вводит с клавиатуры M чисел. 
                                        Посчитайте, сколько чисел больше 0 ввёл пользователь.
git checkout Lesson6task43 - Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, 
                                        заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
                                        значения b1, k1, b2 и k2 задаются пользователем.
*/