/*
        Это ветка Master. Она используется как список решенных в данном файле задач. Для переключения между задачами используйте
их названия, указанные ниже, или при помощи переключения веток на GitHub
       
        6. Задачи шестого (6) семинара:
git checkout Lesson6task41 - Задача 41. Пользователь вводит с клавиатуры M чисел. 
                                        Посчитайте, сколько чисел больше 0 ввёл пользователь.
git checkout Lesson6task43 - Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, 
                                        заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
                                        значения b1, k1, b2 и k2 задаются пользователем.

        7. Задачи седьмого (7) семинара:
git checkout Lesson7task47 - Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.

git checkout Lesson7task50 - Задача 50. Напишите программу, которая на вход принимает позиции элемента в двумерном массиве,
                                         и возвращает значение этого элемента или же указание, что такого элемента нет.

git checkout Lesson7task52 - Задача 52. Задайте двумерный массив из целых чисел.
                                        Найдите среднее арифметическое элементов в каждом столбце.
*/