/*
 Это ветка Master. Она используется как список решенных в данном файле задач. Для переключения между задачами используйте
их названия, указанные ниже, или при помощи переключения веток на GitHub
    
        1. Задачи первого семинара:
git checkout Lesson1task2 - Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт,
                                        какое число большее, а какое меньшее;
git checkout Lesson1task4 - Задача 4: Напишите программу, которая принимает на вход три числа
                                        и выдаёт максимальное из этих чисел;
git checkout Lesson1task6 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
                                        является ли число чётным (делится ли оно на два без остатка).
git checkout Lesson1task8 - Задача 8: Напишите программу, которая на вход принимает число (N), 
                                        а на выходе показывает все чётные числа от 1 до N.

Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2

1, -7, 567, 89, 223-> 3

Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)